tap "cmacrae/formulae"
tap "elastic/tap"
tap "helix-editor/helix"
tap "homebrew/bundle"
tap "homebrew/cask", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask.git"
tap "homebrew/cask-drivers", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask-drivers.git"
tap "homebrew/cask-fonts", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask-fonts.git"
tap "homebrew/cask-versions", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask-versions.git"
tap "homebrew/command-not-found", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-command-not-found.git"
tap "homebrew/core"
tap "homebrew/services"
tap "jandedobbeleer/oh-my-posh"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
tap "railwaycat/emacsmacport"
tap "riscv/riscv"
tap "universal-ctags/universal-ctags"
tap "wez/wezterm"
brew "libpng"
brew "openssl@1.1"
brew "apr-util"
brew "gdbm"
brew "mpdecimal"
brew "xz"
brew "python@3.10"
brew "asciinema"
brew "atuin"
brew "m4"
brew "bat"
brew "bdw-gc"
brew "c-ares"
brew "grpc"
brew "bear"
brew "binutils"
brew "pkg-config"
brew "broot"
brew "ghc"
brew "cabal-install"
brew "gettext"
brew "glib"
brew "libffi"
brew "lzo"
brew "pcre"
brew "pixman"
brew "python@3.9"
brew "chezmoi"
brew "cloc"
brew "cmake"
brew "code-minimap"
brew "gmp"
brew "coreutils"
brew "libunistring"
brew "libidn2"
brew "duf"
brew "dust"
brew "harfbuzz"
brew "elasticsearch"
brew "exa"
brew "fd"
brew "libtool"
brew "guile"
brew "libevent"
brew "libtasn1"
brew "nettle"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "jpeg", link: true
brew "ffmpeg"
brew "ffmpeg@4"
brew "fnm"
brew "pango"
brew "fontforge"
brew "fpp"
brew "fzf"
brew "gawk"
brew "gcc"
brew "gdb"
brew "gh"
brew "ghq"
brew "git"
brew "git-delta"
brew "glances"
brew "libusb"
brew "gnupg"
brew "gnu-sed"
brew "go"
brew "graphviz"
brew "haskell-language-server"
brew "haskell-stack"
brew "lua"
brew "highlight"
brew "httpie"
brew "hub"
brew "hunspell"
brew "imagemagick"
brew "inetutils"
brew "jemalloc"
brew "jq"
brew "kafka"
brew "kibana"
brew "kind"
brew "ncurses"
brew "less"
brew "libev"
brew "libslirp"
brew "libssh"
brew "links"
brew "lua-language-server"
brew "luarocks"
brew "maven"
brew "minikube"
brew "yt-dlp"
brew "mpv"
brew "mycli"
brew "mysql"
brew "navi"
brew "ncdu"
brew "neofetch"
brew "tree-sitter", link: false
brew "neovim"
brew "onefetch"
brew "php"
brew "poppler"
brew "pstree"
brew "pyenv"
brew "vde"
brew "qemu"
brew "qt"
brew "reattach-to-user-namespace"
brew "redis", restart_service: true
brew "ripgrep"
brew "ruby"
brew "rust-analyzer"
brew "sbt"
brew "scala"
brew "scala@2.11"
brew "starship"
brew "subversion"
brew "tmux"
brew "tokei"
brew "topgrade"
brew "tree"
brew "vim"
brew "vivid"
brew "vsftpd"
brew "watch"
brew "websocat"
brew "wget"
brew "wireshark"
brew "wtfutil"
brew "x86_64-elf-binutils"
brew "x86_64-elf-gcc"
brew "xplr"
brew "yq"
brew "zoxide"
brew "jesseduffield/lazygit/lazygit"
brew "railwaycat/emacsmacport/emacs-mac"
brew "riscv/riscv/riscv-tools"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
cask "fig"
cask "hammerspoon"
cask "keycastr"
cask "smlnj"
cask "vagrant"
cask "warp"
