tap "candid82/brew"
tap "cmacrae/formulae"
tap "daipeihust/tap"
tap "elastic/tap"
tap "ellie/atuin"
tap "felixkratz/formulae"
tap "helix-editor/helix"
tap "homebrew/bundle"
tap "homebrew/cask-drivers", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask-drivers.git"
tap "homebrew/cask-fonts", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask-fonts.git"
tap "homebrew/cask-versions", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask-versions.git"
tap "homebrew/command-not-found", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-command-not-found.git"
tap "homebrew/services"
tap "jandedobbeleer/oh-my-posh"
tap "jesseduffield/lazygit"
tap "keith/formulae"
tap "koekeishiya/formulae"
tap "laishulu/macism"
tap "michaeleisel/zld"
tap "morantron/tmux-fingers"
tap "nativeos/i386-elf-toolchain"
tap "oven-sh/bun"
tap "railwaycat/emacsmacport"
tap "riscv/riscv"
tap "romkatv/powerlevel10k"
tap "universal-ctags/universal-ctags"
tap "veeso/termscp"
tap "wez/wezterm"
tap "yqrashawn/goku"
brew "aarch64-elf-binutils"
brew "libpng"
brew "xz"
brew "apr-util"
brew "mpdecimal"
brew "asciinema"
brew "aspell"
brew "atuin"
brew "m4"
brew "bash"
brew "bat"
brew "bdw-gc"
brew "c-ares"
brew "grpc"
brew "bear"
brew "binutils"
brew "blueutil"
brew "broot"
brew "gmp"
brew "gcc"
brew "btop"
brew "ghc"
brew "cabal-install"
brew "gettext"
brew "glib"
brew "pkg-config"
brew "lzo"
brew "pixman"
brew "chezmoi"
brew "cmake"
brew "code-minimap"
brew "coreutils"
brew "libevent"
brew "libunistring"
brew "libidn2"
brew "dos2unix"
brew "duf"
brew "dust"
brew "harfbuzz"
brew "elasticsearch@6", link: true
brew "enchant"
brew "eza"
brew "fd"
brew "libtasn1"
brew "nettle"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "libass"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "ffmpeg@4"
brew "fnm"
brew "libtool"
brew "fontforge"
brew "fpp"
brew "fzf"
brew "gawk"
brew "gdb"
brew "gdbm"
brew "gh"
brew "ghostscript"
brew "ghq"
brew "git"
brew "git-delta"
brew "git-extras"
brew "git-lfs"
brew "libusb"
brew "gnupg"
brew "gnu-sed"
brew "go"
brew "gobject-introspection"
brew "netpbm"
brew "librsvg"
brew "graphviz"
brew "grep"
brew "guile"
brew "gum"
brew "haskell-language-server"
brew "haskell-stack"
brew "lua"
brew "highlight"
brew "httpie"
brew "hub"
brew "hunspell"
brew "libheif"
brew "libffi"
brew "pcre"
brew "python@3.9"
brew "imagemagick"
brew "inetutils"
brew "jemalloc"
brew "jpeg", link: true
brew "jq"
brew "kafka"
brew "kibana"
brew "kind"
brew "ncurses"
brew "less"
brew "libev"
brew "libpq", link: true
brew "libslirp"
brew "libssh"
brew "links"
brew "lua-language-server"
brew "luarocks"
brew "maven"
brew "minikube"
brew "vapoursynth"
brew "yt-dlp"
brew "mpv"
brew "mycli"
brew "mysql"
brew "navi"
brew "ncdu"
brew "neofetch"
brew "tree-sitter", link: false
brew "neovim"
brew "onefetch"
brew "openjdk@11"
brew "parallel"
brew "php"
brew "poppler"
brew "powerlevel10k"
brew "progress"
brew "pstree"
brew "pyenv"
brew "python@3.10"
brew "vde"
brew "qemu"
brew "qt"
brew "reattach-to-user-namespace"
brew "redis", restart_service: true
brew "ripgrep"
brew "rust-analyzer"
brew "sbt"
brew "scala"
brew "subversion"
brew "tealdeer"
brew "thefuck"
brew "tmux"
brew "tokei"
brew "topgrade"
brew "tree"
brew "vim"
brew "vivid"
brew "vsftpd"
brew "watch"
brew "websocat"
brew "wget"
brew "wireshark"
brew "wtfutil"
brew "x86_64-elf-gdb"
brew "yazi"
brew "yq"
brew "zoxide"
brew "daipeihust/tap/im-select"
brew "laishulu/macism/macism"
brew "oven-sh/bun/bun"
brew "railwaycat/emacsmacport/emacs-mac", args: ["with-native-comp"]
brew "riscv/riscv/riscv-tools"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
brew "veeso/termscp/termscp"
brew "yqrashawn/goku/goku"
cask "adoptopenjdk8"
cask "alacritty"
cask "fig"
cask "font-hack-nerd-font"
cask "font-iosevka"
cask "font-jetbrains-mono-nerd-font"
cask "hammerspoon"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-json"
cask "smlnj"
cask "vagrant"
cask "wezterm"
vscode "Catppuccin.catppuccin-vsc"
vscode "Catppuccin.catppuccin-vsc-icons"
vscode "Gruntfuggly.todo-tree"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "rust-lang.rust-analyzer"
vscode "vscodevim.vim"
